/***************************************************************************************************    
工程名称：	18b20_1602
功能描述：	18B20传感器测温，1602显示温度值。
硬件连接：  用1位杜邦线将J11_7与J17_1820连接，将1602液晶接口对应插接到P4接口。
维护记录：  2011-8-22
***************************************************************************************************/
#include"MAIN.H"
#include"DS18B20.H"					


sbit DQ=P2^7;              //温度控制口


void DELAY_X(unsigned int t)   //延迟函数
{
 while(--t);
}
//**************************************************************************************************
//传感器初始化
//**************************************************************************************************
 void init_18b20(void)
{
        unsigned char flag;
        DQ=1;
        DELAY_X(10);  //延时
        DQ=0;
        DELAY_X(500); //*延时，要求精度，要求大于480us*
        DQ=1;
        DELAY_X(200); //*延时，要求精度，要求大于15us*
        flag=DQ;    //DQ管脚送出60-240us的0脉冲,以示初始化成功
        DELAY_X(10);  //延时
}
//**************************************************************************************************
//写一个字节函数
//**************************************************************************************************
void write_byte(unsigned char t)
{
 unsigned char  i;
 for(i=0;i<8;i++)   //循环8次写入1字节
  {
    DQ=0;           //数据线置低
    DELAY_X(10);      //延时
    DQ=t&0x01;      //发送1位数据,最低位开始
    DELAY_X(50);      //*延时，要求精度*
    DQ=1;           //数据线置高
    t=t>>1;         //右移1位
  }
}
//**************************************************************************************************
//读一个字节函数
//**************************************************************************************************
unsigned char read_byte()
{
unsigned char i, value=0;
 for(i=0;i<8;i++)   //循环8次读取1字节
  {
    value=value>>1; //右移1位
    DQ=0;           //数据线置低
    DELAY_X(10);      //延时
    DQ=1;           //数据线置高
    DELAY_X(10);      //延时
    if(DQ==1)value=value|0x80;//判断接收的1位数据是否为1
    DELAY_X(50);      //*延时，要求精度*
  }
 return(value);
}

//**************************************************************************************************
//温度采集函数
//**************************************************************************************************
 unsigned int get_temp()
{
    unsigned int dat;
    unsigned char wenl,wenh;
    init_18b20();         //复位
    write_byte(0xcc);     //不进行编号匹配
    write_byte(0x44);     //进行温度转换
    init_18b20();         //复位   
    write_byte(0xcc);     //不进行编号匹配
    write_byte(0xbe);     //发读命令
    wenl=read_byte();     //温度低八位
    wenh=read_byte();     //温度高八位
    dat=(wenh<<8)+wenl;   //数据高低8位合并
    return(dat);          //返回测量结果
}
//**************************************************************************************************
//数据处理子函数
//**************************************************************************************************
unsigned char Get_DS18B20_Value(void)
{
 float t;
 unsigned int temp;
 temp=get_temp();
 t=temp*0.0625+0.05;     //计算出温度值，百分位四舍五入
 return t;
}

